ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/spim_regs.h
/**
 * @file
 * @brief   Registers, Bit Masks and Bit Positions for the SPIM Peripheral Module.
 */

/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-10-10 19:42:44 -0500 (Mon, 10 Oct 2016) $
 * $Revision: 24672 $
 *
 *************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_SPIM_REGS_H_
#define _MXC_SPIM_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif


///@cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __RO
#define __RO volatile const
#endif
///@endcond


/**
 * @ingroup     spim
 * @defgroup    spim_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions for the SPIM Peripheral Module.
 * @{
 */

/**
 * Structure type to access the SPIM Peripheral Module Registers
 */
typedef struct {
    __IO uint32_t mstr_cfg;                             /**< <tt>\b 0x0000:</tt> SPIM_MSTR_CFG Register - SPI Master Configuration Register                  */
    __IO uint32_t ss_sr_polarity;                       /**< <tt>\b 0x0004:</tt> SPIM_SS_SR_POLARITY Register - SPI Master Polarity Control for SS and SR Signals  */
    __IO uint32_t gen_ctrl;                             /**< <tt>\b 0x0008:</tt> SPIM_GEN_CTRL Register - SPI Master General Control Register                */
    __IO uint32_t fifo_ctrl;                            /**< <tt>\b 0x000C:</tt> SPIM_FIFO_CTRL Register - SPI Master FIFO Control Register                   */
    __IO uint32_t spcl_ctrl;                            /**< <tt>\b 0x0010:</tt> SPIM_SPCL_CTRL Register - SPI Master Special Mode Controls                   */
    __IO uint32_t intfl;                                /**< <tt>\b 0x0014:</tt> SPIM_INTFL Register - SPI Master Interrupt Flags                         */
    __IO uint32_t inten;                                /**< <tt>\b 0x0018:</tt> SPIM_INTEN Register - SPI Master Interrupt Enable/Disable Settings       */
    __IO uint32_t simple_headers;                       /**< <tt>\b 0x001C:</tt> SPIM_SIMPLE_HEADERS Register - SPI Master Simple Mode Transaction Headers         */
} mxc_spim_regs_t;


/**
 * @ingroup spim_registers
 * @defgroup spim_fifos SPIM TX and RX FIFOs
 * @brief TX and RX FIFO access for reads and writes using 8-bit, 16-bit and 32-bit data types.
 * @{
 */
/**
 * Structure type for the SPIM Transmit and Receive FIFOs.
 */
typedef struct {
    union {                                             /*  0x0000-0x07FC   SPI Master FIFO Write Space for Transaction Setup                            */
        __IO uint8_t  trans_8[2048];                    /**< 8-bit access to Transmit FIFO */
        __IO uint16_t trans_16[1024];                   /**< 16-bit access to Transmit FIFO */
        __IO uint32_t trans_32[512];                    /**< 32-bit access to Transmit FIFO */
    };
    union {                                             /*  0x0800-0x0FFC   SPI Master FIFO Read Space for Results Data                                  */
        __IO uint8_t  rslts_8[2048];                    /**< 8-bit access to Receive FIFO */
        __IO uint16_t rslts_16[1024];                   /**< 16-bit access to Receive FIFO */
        __IO uint32_t rslts_32[512];                    /**< 32-bit access to Receive FIFO */
    };
} mxc_spim_fifo_regs_t;
/**@} end of group spim_fifos */
/**@} end of group spim_registers */


/*
   Register offsets for module SPIM.
*/
/**
 * @ingroup    spim_registers
 * @defgroup   SPIM_Register_Offsets Register Offsets
 * @brief      SPI Master Register Offsets from the SPIM[n] Base Peripheral Address, where  \c n \c = SPIM Instance Number.
 * @{
 */
#define MXC_R_SPIM_OFFS_MSTR_CFG                            ((uint32_t)0x00000000UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0000</tt>*/
#define MXC_R_SPIM_OFFS_SS_SR_POLARITY                      ((uint32_t)0x00000004UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0004</tt>*/
#define MXC_R_SPIM_OFFS_GEN_CTRL                            ((uint32_t)0x00000008UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0008</tt>*/
#define MXC_R_SPIM_OFFS_FIFO_CTRL                           ((uint32_t)0x0000000CUL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x000C</tt>*/
#define MXC_R_SPIM_OFFS_SPCL_CTRL                           ((uint32_t)0x00000010UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0010</tt>*/
#define MXC_R_SPIM_OFFS_INTFL                               ((uint32_t)0x00000014UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0014</tt>*/
#define MXC_R_SPIM_OFFS_INTEN                               ((uint32_t)0x00000018UL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x0018</tt>*/
#define MXC_R_SPIM_OFFS_SIMPLE_HEADERS                      ((uint32_t)0x0000001CUL)    /**< Offset from SPIM[n] Base Address: <tt>\b 0x001C</tt>*/
/**@} end of group SPIM_Register_Offsets*/
/**
 * @ingroup    spim_registers
 * @defgroup   SPIM_FIFO_Offsets FIFO Offsets
 * @brief      SPI Master FIFO Offsets from the SPIM[n] Base FIFO Address, where  \c n \c = SPIM Instance Number.
 * @{
 */
#define MXC_R_SPIM_FIFO_OFFS_TRANS                          ((uint32_t)0x00000000UL)    /**< Offset from SPIM[n] Base FIFO Address: <tt>\b 0x0000</tt>*/
#define MXC_R_SPIM_FIFO_OFFS_RSLTS                          ((uint32_t)0x00000800UL)    /**< Offset from SPIM[n] Base FIFO Address: <tt>\b 0x0800</tt>*/
/**@} end of group SPIM_FIFO_Offsets*/

